## Plan Result (sbox_apim)




<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_api_management_named_value.environment
  * module.api-mgmt.azurerm_api_management.apim
  * module.api-mgmt.azurerm_api_management_api.apim
  * module.api-mgmt.azurerm_api_management_api_operation.apim
  * module.api-mgmt.azurerm_api_management_api_policy.apim
  * module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain
  * module.api-mgmt.azurerm_api_management_logger.apim
  * module.api-mgmt.azurerm_role_assignment.apim




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_named_value.environment will be created
  + resource "azurerm_api_management_named_value" "environment" {
      + api_management_name = "cft-api-mgmt-sbox"
      + display_name        = "environment"
      + id                  = (known after apply)
      + name                = "environment"
      + resource_group_name = "cft-sbox-network-rg"
      + secret              = false
      + value               = (sensitive value)
    }

  # module.api-mgmt.data.azurerm_api_management.apim will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management" "apim" {
      + additional_location       = (known after apply)
      + developer_portal_url      = (known after apply)
      + gateway_regional_url      = (known after apply)
      + gateway_url               = (known after apply)
      + hostname_configuration    = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + location                  = (known after apply)
      + management_api_url        = (known after apply)
      + name                      = "cft-api-mgmt-sbox"
      + notification_sender_email = (known after apply)
      + portal_url                = (known after apply)
      + private_ip_addresses      = (known after apply)
      + public_ip_address_id      = (known after apply)
      + public_ip_addresses       = (known after apply)
      + publisher_email           = (known after apply)
      + publisher_name            = (known after apply)
      + resource_group_name       = "cft-sbox-network-rg"
      + scm_url                   = (known after apply)
      + sku_name                  = (known after apply)
      + tags                      = (known after apply)
      + tenant_access             = (known after apply)
    }

  # module.api-mgmt.azurerm_api_management.apim will be created
  + resource "azurerm_api_management" "apim" {
      + client_certificate_enabled    = false
      + developer_portal_url          = (known after apply)
      + gateway_disabled              = false
      + gateway_regional_url          = (known after apply)
      + gateway_url                   = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + management_api_url            = (known after apply)
      + name                          = "cft-api-mgmt-sbox"
      + notification_sender_email     = "apimgmt-noreply@mail.windowsazure.com"
      + policy                        = (known after apply)
      + portal_url                    = (known after apply)
      + private_ip_addresses          = (known after apply)
      + public_ip_addresses           = (known after apply)
      + public_network_access_enabled = true
      + publisher_email               = "DTSPlatformOperations@justice.gov.uk"
      + publisher_name                = "HMCTS Platform Operations"
      + resource_group_name           = "cft-sbox-network-rg"
      + scm_url                       = (known after apply)
      + sku_name                      = "Developer_1"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + virtual_network_type          = "Internal"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + security {
          + enable_backend_ssl30                                = false
          + enable_backend_tls10                                = false
          + enable_backend_tls11                                = false
          + enable_frontend_ssl30                               = false
          + enable_frontend_tls10                               = false
          + enable_frontend_tls11                               = false
          + tls_ecdhe_ecdsa_with_aes128_cbc_sha_ciphers_enabled = false
          + tls_ecdhe_ecdsa_with_aes256_cbc_sha_ciphers_enabled = false
          + tls_ecdhe_rsa_with_aes128_cbc_sha_ciphers_enabled   = false
          + tls_ecdhe_rsa_with_aes256_cbc_sha_ciphers_enabled   = false
          + tls_rsa_with_aes128_cbc_sha256_ciphers_enabled      = false
          + tls_rsa_with_aes128_cbc_sha_ciphers_enabled         = false
          + tls_rsa_with_aes128_gcm_sha256_ciphers_enabled      = false
          + tls_rsa_with_aes256_cbc_sha256_ciphers_enabled      = false
          + tls_rsa_with_aes256_cbc_sha_ciphers_enabled         = false
          + tls_rsa_with_aes256_gcm_sha384_ciphers_enabled      = false
          + triple_des_ciphers_enabled                          = false
        }

      + virtual_network_configuration {
          + subnet_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet/subnets/api-management"
        }
    }

  # module.api-mgmt.azurerm_api_management_api.apim will be created
  + resource "azurerm_api_management_api" "apim" {
      + api_management_name   = "cft-api-mgmt-sbox"
      + api_type              = (known after apply)
      + display_name          = "Health Check"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "health"
      + path                  = "health"
      + protocols             = [
          + "http",
          + "https",
        ]
      + resource_group_name   = "cft-sbox-network-rg"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)
    }

  # module.api-mgmt.azurerm_api_management_api_operation.apim will be created
  + resource "azurerm_api_management_api_operation" "apim" {
      + api_management_name = "cft-api-mgmt-sbox"
      + api_name            = "health"
      + description         = "This can only be done by the logged in user."
      + display_name        = "Liveness check"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "liveness-check"
      + resource_group_name = "cft-sbox-network-rg"
      + url_template        = "/liveness"

      + response {
          + status_code = 200

          + representation {
              + content_type = "application/json"

              + example {
                  + name  = "sample value"
                  + value = jsonencode(
                        {
                          + status = "Up"
                        }
                    )
                }
            }
        }
    }

  # module.api-mgmt.azurerm_api_management_api_policy.apim will be created
  + resource "azurerm_api_management_api_policy" "apim" {
      + api_management_name = "cft-api-mgmt-sbox"
      + api_name            = "health"
      + id                  = (known after apply)
      + resource_group_name = "cft-sbox-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <mock-response status-code="200" content-type="application/json" />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain will be created
  + resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
      + api_management_id = (known after apply)
      + id                = (known after apply)

      + gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "cft-api-mgmt.sandbox.platform.hmcts.net"
          + key_vault_id                 = "https://acmedcdcftappssbox.vault.azure.net/secrets/wildcard-sandbox-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
      + gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "cft-api-mgmt-appgw.sandbox.platform.hmcts.net"
          + key_vault_id                 = "https://acmedcdcftappssbox.vault.azure.net/secrets/wildcard-sandbox-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
      + gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "cft-mtls-api-mgmt-appgw.sandbox.platform.hmcts.net"
          + key_vault_id                 = "https://acmedcdcftappssbox.vault.azure.net/secrets/wildcard-sandbox-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
    }

  # module.api-mgmt.azurerm_api_management_logger.apim will be created
  + resource "azurerm_api_management_logger" "apim" {
      + api_management_name = "cft-api-mgmt-sbox"
      + buffered            = true
      + id                  = (known after apply)
      + name                = "cft-api-mgmt-sbox-logger"
      + resource_group_name = "cft-sbox-network-rg"
      + resource_id         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Insights/components/cft-api-mgmt-sbox"

      + application_insights {
          + instrumentation_key = (sensitive value)
        }
    }

  # module.api-mgmt.azurerm_role_assignment.apim will be created
  + resource "azurerm_role_assignment" "apim" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1761,"Program":"tfcmt","SHA1":"","Target":"sbox_apim","Vars":{}} -->